#define USE_HTML_STATUS
#define USE_HTML_PROMPT

//#define _GENDETAILED

#include <advr.t>
#include <generator.t>
#include <stdr.t>
#include <errorru.t>
#include <extendr.t>
#include <spellchecker.t>


startroom:room
;

sample: thing
gdesc='образец/1м'
noun=
'письмена/2' 	//2  -ена
'знамЄна/2с' 	//2  -Єна
'брЄвна/2'   	//2  -(согл)на
'реб€та/2'   	//2  -та
'дома/2'		//2м -а
'гнЄзда/2'	//2  -а
'корица/1'	//   -ца
'борьба/1' 'кома/1'	//   -[бвдзлмнпрстфц]а
'река/1'	//   -а

'врем€/1'	//   -м€
'большј€/1п'	//   -ша€
'чужј€/1п'	//U  -(4|ж)а€
'рыжа€/1п' 'пахуча€/1п' // -(4|ж)а€
'лыса€/1п'	//   -а€
'преисподн€€/1ж' 'передн€€/1'	//   -€€
'перь€/2'	//2  -ь€
'последстви€/2'	//2  -и€
'импери€/1'	//   -и€
'тл€/i гир€/'	//   -€
'ковбой/ злой/п' //-ой
'чирей/ буй/ чистоплюй/о май/' //-(еуюа)й
'ученый/ полезный/ злотый/' //-ый
'калий/ нищий/по'	//-ий
'камень/1м коготь/1m'
'делимое/'
/*
'топор/, комод/, балда/, кобра/, олово/, пекло; твердый/, тусклый/'
'тюлень/, искатель/, цапл€/, ƒун€/, горе/, поле/, весенний/'
*/

/*
'петух/, сапог/, нер€ха/, кор€га/, золотко/, м€гкий/'
'калач/ , лаваш/, галоша/, св€тоша/, жилище/, вече/, в€щий/'
'немец/, конец/, девица/, деревце/, куцый/'
'бой/, край/'
'сложение/, мани€/'
'тетрадь/, зыбь/'
'платок/, кошка/, сердце/'
*/


/*
'альфа/, бета/, гамма/ . дельта/  ;;' // проверка разделени€
*/

/*
'молотобоец/1о'	//   -(глас)ец
'жилец/1о'	//   -(глас)(согл)ец
'писец/1о'	//   -(глас)(согл)ец
'хитрец/1о'	//   -последнее правило
*/
;
